#include "App.h"

#include "Scene/SceneMng.h"
#include "GamePlayData/GamePlayData.h"

SceneMng sceneMng;

//---------------------------------------------------------
//ゲームの初期化処理を行う関数
//---------------------------------------------------------
//画面の左上がゲーム空間の原点(0,0)となるようにカメラを移動させる
void App::Init() {
	{
		Camera camera;
		camera.SetPosition(WINDOW_WIDTH / 2.0f, -WINDOW_HEIGHT / 2.0f);
		RenderManager_I->SetCamera(camera);
	}
	sceneMng.Init(SceneType::Title);
}

//---------------------------------------------------------
//ゲームの更新処理を行う関数
//---------------------------------------------------------
void App::Update() {
	sceneMng.Update();
}

//---------------------------------------------------------
//ゲームの描画処理を行う関数
//---------------------------------------------------------
void App::Render() {
	sceneMng.Render();
}

//---------------------------------------------------------
// ゲームの後片付け処理を行う関数
//---------------------------------------------------------
void App::Term() {
	sceneMng.Term();

}
